# QG训练营嵌入式组第3周周四两日结
## 生活小记
1. 这两天连续熬夜，晚上总是三点才睡，累是肯定的，但是，没关系，我没有别的大佬那么厉害，我可以多花点时间；
2. 昨晚认识了乡会几个出色的师兄，优秀就是优秀，大三就拿到offer了；
3. 今天去上课路上，亲眼见识到马路上一位同学为了赶时间不迟到，差点被一辆摩托撞到了，连我都吓了一跳——生命安全还是重要一些；
4. 今天还是要感谢好朋友的鼎力相助；
## 学习开发比赛概要
1. 学到一种快捷转化后缀表达式的方法——括号法，但这种办法更适合笔试的时候用，编程如果用这种办法可能会更难；
2. 学会Markdown、Git、Github的基础用法；（找不到公钥的解决办法之一：创建一个 .ssh 的文件然后用复制命令—— clip<~/.ssh/id_rsa.pub ）；
3. 实现四则运算的代码撰写，但是关于后缀表达式使用的栈的类型，不知道该用什么类型才好；
4. 四则运算难点——字符的转换；
## 感想收获
1. 累一点无所谓，但千万不能让付出失去应有的意义；
2. 充实的每一天过得特别快，写不出代码，找不出bug的时候，真希望时间可以过得慢一点，哈哈；
## 存在问题（备注）
### 问题
1. 中缀表达式转化为后缀表达式后，进行运算时不知道该使用什么类型的栈，考虑到小数、整数、字符都要存进去，就不知道该怎么才好了；
2. 最近事情有点不在掌控之内，搞得时间有点不够用，不行，要掌控回来；
### 备注
1. 记得记得记得记得！！！指针一定要初始化！！
2. 其实今天12点前已经写好了的，但是今天没有按时交作业，原因是：
   1. git那些操作不熟悉，cd D：一直打成cd：D，结果一直找不到文件，然后以为是当时建立本地仓库的时候错了，重新回去建；
   2. 不知道提交什么文本类型的作业，以为是有一个.md类型的，但是又一直弄不出来，所以时间久这样一点点溜走了；